'VB_VER
'20170209 V050c 修正不同From下Textbox物件內容不同步問題
'20170209 V050d 測試結果Form調整
'20170209 V050e Sensor_Interface調整
'20170210 V050f RAM_DATA位置調整
'20170210 V050g ECU ES34 SPI/PWM 自動判定
'[20170214] [V050h] Arduino ES34 SPI 通訊 ON/OFF 設定
'[20170214] [V050i] Arduino ES34 PWM Error ON/OFF 設定
'[20170217] [V050j] 加入回油制御顯示值
'[20170224] [V050k] 
'[20170413] [V050l] PWM rpm顯示值調整
'[20170418] [V050m] Cds外部控制
'[20170419] [V050n] 緊急停止功能鍵建立
'[20170523] [V050o] 壓縮機可以由外部控制(含保護功能)
'[20170621] [V060a] 加入基本功能測試Script
'[20170629] [V060b] 加入LIN Rx, Tx counter
'[20170629] [V060c] 通訊協定加入CHKSUM(Sensor_Interface表單 無法開啟)
'[20170703] [V060d] (Sensor_Interface表單 無法開啟 => 可開啟)
'[20170720] [V061a] (調整datalog儲存格式)
'[20170724] [V061b] (加入最大轉速設定)
'[20170801] [V061c] KP,KI,KD 外部設定,會儲存在EEPROM 
'[20170815] [V061d] 加入電源輸出指示 
'[20170922] [V061e] 加入YAB值設定
'[20171117] [V061g] 繪圖演算法更新 
'[20171123] [V061h] 介面調整
'[20171208] [V061i] 介面調整, 半自動測試
'[20171212] [V062a] 介面調整, DNJP用 (PW:22318874)
'[20171213] [V066]  Release 給日本
'[20180113] [V067a] 電腦主機板更換BIOS電池後, 硬碟的存取好像變快了。
'[20180117] [V067b] Panel亮度外部控制   
'[20180130] [V067c] ES34-PWM轉速計算修正   
'[20180703] [V067d] 參數可調MAX值(預設)也可以讀取保存 [備存]   
'[20180807] [V067e] 內氣溫計算修正 
'[20180831] [V067f] 內氣溫計算值會漂
'[20180926] [V068a] DNJP樣品 - 出張準備
'[20181101] [V068b] Bootloader載入功能完成
'                   需搭配 d:\SReecCvt\NewFileName.txt   取得最後一次轉換的S19檔案
'[20181126] [V068c] d:\SReecCvt\NewFileName.txt ==> 改成  d:\SReecCvt\VB_Load_FileName.txt
'                   加入 (1)THI & SPH 模擬  (2)傳送的Ring Buffer
'[20181127] [V068d] 測試狀態 - test_report 產出
'[20181206] [V068j] 給DNJP(bootloader燒錄機能追加)
'[20181218] [V068l] 系統模擬功能(參數可儲存)
'[20181228] [V068m] Y值計算除錯
'[20190201] [V068n] 調整中(備份)
'[20190327] [V068o] 測試Script格式調整中(備份)
'[20190626] [V068p] DCDC資訊顯示(備份)
'[20190717] [V068q] 修正Pcb V3.7 I/O測試時, HWEN錯誤
'[20190726] [V068q] 加入可選擇繪圖控制曲線的來源項目(初版)
'[20190801] [V068s] 不同ver pcb 介面整理 (初版)
'[20190807] [V068t] 不同ver pcb 介面整理
'[20190905] [V068u] ESB34通訊狀態分析介面整理
'[20190917] [V068v] 給日本的Volvo仕樣介面調整
'[20200325] [V068x] Y值計算驗證介面微調, Sensor值由外部提供機能
'[20200716] [V071a] 統合介面整合
'[20200722] [V071b] Board2整合(LIN_11bytes資料)
'[20200824] [V071f] HVIL電流計算值修正
'[20200831] [V071g] Volvo運轉模式追加
'[20200903] [V071g] Volvo追加 CAN:Break訊號

'已使用
'MSG000
'MSG001

